grevaillot/svd_tools/headers/STM32H7B3x/bdma1.h
/** @defgroup bdma1_bdma_cpar2 BDMACPAR2 This register must not be written when the channel is enabled.
@{*/


#define BDMA1_BDMA_CPAR2_PA_SHIFT		0
#define BDMA1_BDMA_CPAR2_PA_MASK		0xffffffff
/** @defgroup bdma1_bdma_cpar2_pa PA Peripheral address Base address of the peripheral data register from/to which the data will be read/written. When PSIZE is 01 (16-bit), the PA[0] bit is ignored. Access is automatically aligned to a half-word address. When PSIZE is 10 (32-bit), PA[1:0] are ignored. Access is automatically aligned to a word address.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma1_bdma_cm0ar2 BDMACM0AR2 This register must not be written when the channel is enabled.
@{*/


#define BDMA1_BDMA_CM0AR2_MA_SHIFT		0
#define BDMA1_BDMA_CM0AR2_MA_MASK		0xffffffff
/** @defgroup bdma1_bdma_cm0ar2_ma MA Memory address Base address of the memory area from/to which the data will be read/written. When MSIZE is 01 (16-bit), the MA[0] bit is ignored. Access is automatically aligned to a half-word address. When MSIZE is 10 (32-bit), MA[1:0] are ignored. Access is automatically aligned to a word address.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma1_bdma_cm1ar2 BDMACM1AR2 BDMA_CM1AR2
@{*/


/**@}*/

/** @defgroup bdma1_bdma_ccr3 BDMACCR3 DMA channel x configuration register
@{*/

/** BDMA1_BDMA_CCR3_MEM2MEM Memory to memory mode This bit is set and cleared by software. **/
#define BDMA1_BDMA_CCR3_MEM2MEM		(1 << 14)

#define BDMA1_BDMA_CCR3_PL_SHIFT		12
#define BDMA1_BDMA_CCR3_PL_MASK		0x03
/** @defgroup bdma1_bdma_ccr3_pl PL Channel priority level These bits are set and cleared by software.
@{*/
/**@}*/


#define BDMA1_BDMA_CCR3_MSIZE_SHIFT		10
#define BDMA1_BDMA_CCR3_MSIZE_MASK		0x03
/** @defgroup bdma1_bdma_ccr3_msize MSIZE Memory size These bits are set and cleared by software.
@{*/
/**@}*/


#define BDMA1_BDMA_CCR3_PSIZE_SHIFT		8
#define BDMA1_BDMA_CCR3_PSIZE_MASK		0x03
/** @defgroup bdma1_bdma_ccr3_psize PSIZE Peripheral size These bits are set and cleared by software.
@{*/
/**@}*/

/** BDMA1_BDMA_CCR3_MINC Memory increment mode This bit is set and cleared by software. **/
#define BDMA1_BDMA_CCR3_MINC		(1 << 7)
/** BDMA1_BDMA_CCR3_PINC Peripheral increment mode This bit is set and cleared by software. **/
#define BDMA1_BDMA_CCR3_PINC		(1 << 6)
/** BDMA1_BDMA_CCR3_CIRC Circular mode This bit is set and cleared by software. **/
#define BDMA1_BDMA_CCR3_CIRC		(1 << 5)
/** BDMA1_BDMA_CCR3_DIR Data transfer direction This bit is set and cleared by software. **/
#define BDMA1_BDMA_CCR3_DIR		(1 << 4)
/** BDMA1_BDMA_CCR3_TEIE Transfer error interrupt enable This bit is set and cleared by software. **/
#define BDMA1_BDMA_CCR3_TEIE		(1 << 3)
/** BDMA1_BDMA_CCR3_HTIE Half transfer interrupt enable This bit is set and cleared by software. **/
#define BDMA1_BDMA_CCR3_HTIE		(1 << 2)
/** BDMA1_BDMA_CCR3_TCIE Transfer complete interrupt enable This bit is set and cleared by software. **/
#define BDMA1_BDMA_CCR3_TCIE		(1 << 1)
/** BDMA1_BDMA_CCR3_EN Channel enable This bit is set and cleared by software. **/
#define BDMA1_BDMA_CCR3_EN		(1 << 0)

/**@}*/

/** @defgroup bdma1_bdma_cndtr3 BDMACNDTR3 DMA channel x number of data register
@{*/


#define BDMA1_BDMA_CNDTR3_NDT_SHIFT		0
#define BDMA1_BDMA_CNDTR3_NDT_MASK		0xffff
/** @defgroup bdma1_bdma_cndtr3_ndt NDT Number of data to transfer Number of data to be transferred (0 up to 65535). This register can only be written when the channel is disabled. Once the channel is enabled, this register is read-only, indicating the remaining bytes to be transmitted. This register decrements after each DMA transfer. Once the transfer is completed, this register can either stay at zero or be reloaded automatically by the value previously programmed if the channel is configured in auto-reload mode. If this register is zero, no transaction can be served whether the channel is enabled or not.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma1_bdma_cpar3 BDMACPAR3 This register must not be written when the channel is enabled.
@{*/


#define BDMA1_BDMA_CPAR3_PA_SHIFT		0
#define BDMA1_BDMA_CPAR3_PA_MASK		0xffffffff
/** @defgroup bdma1_bdma_cpar3_pa PA Peripheral address Base address of the peripheral data register from/to which the data will be read/written. When PSIZE is 01 (16-bit), the PA[0] bit is ignored. Access is automatically aligned to a half-word address. When PSIZE is 10 (32-bit), PA[1:0] are ignored. Access is automatically aligned to a word address.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma1_bdma_cm0ar3 BDMACM0AR3 This register must not be written when the channel is enabled.
@{*/


#define BDMA1_BDMA_CM0AR3_MA_SHIFT		0
#define BDMA1_BDMA_CM0AR3_MA_MASK		0xffffffff
/** @defgroup bdma1_bdma_cm0ar3_ma MA Memory address Base address of the memory area from/to which the data will be read/written. When MSIZE is 01 (16-bit), the MA[0] bit is ignored. Access is automatically aligned to a half-word address. When MSIZE is 10 (32-bit), MA[1:0] are ignored. Access is automatically aligned to a word address.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma1_bdma_cm1ar3 BDMACM1AR3 BDMA_CMAR3
@{*/


/**@}*/

/** @defgroup bdma1_bdma_ccr4 BDMACCR4 DMA channel x configuration register
@{*/

/** BDMA1_BDMA_CCR4_MEM2MEM Memory to memory mode This bit is set and cleared by software. **/
#define BDMA1_BDMA_CCR4_MEM2MEM		(1 << 14)

#define BDMA1_BDMA_CCR4_PL_SHIFT		12
#define BDMA1_BDMA_CCR4_PL_MASK		0x03
/** @defgroup bdma1_bdma_ccr4_pl PL Channel priority level These bits are set and cleared by software.
@{*/
/**@}*/


#define BDMA1_BDMA_CCR4_MSIZE_SHIFT		10
#define BDMA1_BDMA_CCR4_MSIZE_MASK		0x03
/** @defgroup bdma1_bdma_ccr4_msize MSIZE Memory size These bits are set and cleared by software.
@{*/
/**@}*/


#define BDMA1_BDMA_CCR4_PSIZE_SHIFT		8
#define BDMA1_BDMA_CCR4_PSIZE_MASK		0x03
/** @defgroup bdma1_bdma_ccr4_psize PSIZE Peripheral size These bits are set and cleared by software.
@{*/
/**@}*/

/** BDMA1_BDMA_CCR4_MINC Memory increment mode This bit is set and cleared by software. **/
#define BDMA1_BDMA_CCR4_MINC		(1 << 7)
/** BDMA1_BDMA_CCR4_PINC Peripheral increment mode This bit is set and cleared by software. **/
#define BDMA1_BDMA_CCR4_PINC		(1 << 6)
/** BDMA1_BDMA_CCR4_CIRC Circular mode This bit is set and cleared by software. **/
#define BDMA1_BDMA_CCR4_CIRC		(1 << 5)
/** BDMA1_BDMA_CCR4_DIR Data transfer direction This bit is set and cleared by software. **/
#define BDMA1_BDMA_CCR4_DIR		(1 << 4)
/** BDMA1_BDMA_CCR4_TEIE Transfer error interrupt enable This bit is set and cleared by software. **/
#define BDMA1_BDMA_CCR4_TEIE		(1 << 3)
/** BDMA1_BDMA_CCR4_HTIE Half transfer interrupt enable This bit is set and cleared by software. **/
#define BDMA1_BDMA_CCR4_HTIE		(1 << 2)
/** BDMA1_BDMA_CCR4_TCIE Transfer complete interrupt enable This bit is set and cleared by software. **/
#define BDMA1_BDMA_CCR4_TCIE		(1 << 1)
/** BDMA1_BDMA_CCR4_EN Channel enable This bit is set and cleared by software. **/
#define BDMA1_BDMA_CCR4_EN		(1 << 0)

/**@}*/

/** @defgroup bdma1_bdma_cndtr4 BDMACNDTR4 DMA channel x number of data register
@{*/


